# Advanced Pandas

This notebook covers the following advanced pandas techniques:

- String methods
- map
- apply 
- iterrows

In accordance with the slides, this tutorial will use the Titanic Data Set.

In [1]:
import pandas as pd

df_titanic = pd.read_csv("Data/Titanic.csv")

df_titanic.head(20)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S
10,902,3,"Ilieff, Mr. Ylio",male,NaN,0,0,349220,7.8958,NaN,S
11,903,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
13,905,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
15,907,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24.0,1,0,SC/PARIS 2167,27.7208,NaN,C
16,908,2,"Keane, Mr. Daniel",male,35.0,0,0,233734,12.3500,NaN,Q
17,909,3,"Assaf, Mr. Gerios",male,21.0,0,0,2692,7.2250,NaN,C
18,910,3,"Ilmakangas, Miss. Ida Livija",female,27.0,1,0,STON/O2. 3101270,7.9250,NaN,S
19,911,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,45.0,0,0,2696,7.2250,NaN,C

## String Methods

We can use the usual string methods to manipulate data inside of a dataframe. To invoke a string method use the .str attribute of a series. Since the only column that is stored as a string is the Name column we will work with that.

In [2]:
#Using the lower() method

df_titanic["Name"].str.lower().head()

0                                kelly, mr. james
1                wilkes, mrs. james (ellen needs)
2                       myles, mr. thomas francis
3                                wirz, mr. albert
4    hirvonen, mrs. alexander (helga e lindqvist)
Name: Name, dtype: object

The above bit of code returns the Name column as a str with all lowercase letters. Another useful string method is the contains() method, which returns a boolean if the given string contain the input string.

In [3]:
#using contains() method to check for title Mr.
df_titanic["Name"].str.contains("Mr\.").head()

0     True
1    False
2     True
3     True
4    False
Name: Name, dtype: bool

Note that we need the escape character "\" to look for the ".".  We can easily the results of the returned series in a new column as follows.

In [4]:
#Creating new column
df_titanic["Bool_Mr"] = df_titanic["Name"].str.contains("Mr\.")

df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Bool_Mr
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,True
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,False
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,True
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,True
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,False

Now we have a new boolean column and we can easily figure out, for example, the total number of "Mr."s as follows

In [5]:
#Computing the proportion of Mr.s
df_titanic.Bool_Mr.mean()

0.57416267942583732

We can also use these string methods on the column names. Let's say I want to replace all the underscores (there is only one) with blank spaces.  I can do that with the replace method. Recall that I access the column names through the columns attribute of any dataframe.

In [6]:
df_titanic.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Bool_Mr'],
      dtype='object')

In [7]:
#Replace the underscore
df_titanic.columns = df_titanic.columns.str.replace("_", "")

df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,BoolMr
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,True
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,False
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,True
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,True
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,False

Notice the name of the column we created above has been changed.  Before we move to the next section, I will delete this column.

In [8]:
del df_titanic["BoolMr"]

df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Map

The map method lets us map values in a column to other values. Let's use map to create a binary column that is 1 for females and 0 for males. We give the mapping that we want by providing the appropriate dictionary

In [9]:
#Using map
df_titanic.Sex.map({"male":1, "female":0}).head()

0    1
1    0
2    1
3    1
4    0
Name: Sex, dtype: int64

The result is a series, which we can again store as a column

In [10]:
#Use map to create new column
df_titanic["Binary_Male"] = df_titanic.Sex.map({"male":1, "female":0})

df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Binary_Male
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0

Let's compute the fraction of male passengers.

In [11]:
#Compute fraction of male passengers
df_titanic.Binary_Male.mean()

0.6363636363636364

## Apply

The apply method applies built-in or custom functions to each row or column of a dataframe. Let's use the apply method to compute the average age and fair. We will need the mean function from numpy to do so.

In [12]:
#Using apply - axis =0
import numpy as np

df_titanic[["Age", "Fare"]].apply(np.mean,axis=0)

Age     30.272590
Fare    35.627188
dtype: float64

When using apply, you first specify the function you want applied and then you specify whether you want the function applied to each row (axis = 1) or each column (axis = 0).  The result is a series where the index are the column names.

In [13]:
#Using apply - axis = 1
df_titanic[["Age", "Fare"]].apply(np.mean,axis=1).head()

0    21.16460
1    27.00000
2    35.84375
3    17.83125
4    17.14375
dtype: float64

Now let's say we also want to look at rounded  versions of the columns corresponding to the rounded age and fare. We can use numpy's round function and the apply method to accomplish this.

In [14]:
#Using apply with the round function
rounded_cols = df_titanic[["Age", "Fare"]].apply(np.round).head()
rounded_cols.head()

    Age  Fare
0  34.0   8.0
1  47.0   7.0
2  62.0  10.0
3  27.0   9.0
4  22.0  12.0

The main benefit of apply is using it with custom functions. Each passenger has a title (Mr., Mrs., etc ...).  The title comes after the comma in the name.  Let's write a custom function to get this title from each name a and store it in a column.

In [15]:
def Get_Title(name):
    
    parsed_name = name.split(" ")
    for i in range(len(parsed_name)):
        if ","  in parsed_name[i]:
            return parsed_name[i+1]
        
    
    return title

In [16]:
#Use apply with this custome function
df_titanic.Name.apply(Get_Title).head()

0     Mr.
1    Mrs.
2     Mr.
3     Mr.
4    Mrs.
Name: Name, dtype: object

Just like with the built in functions, we supply the name of the function we want applied to each value in the column.  The result is a series that we can store as a new column.

In [17]:
#Add  in the new Title column
df_titanic["Title"] = df_titanic.Name.apply(Get_Title)

df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Binary_Male,Title
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1,Mr.
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0,Mrs.
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1,Mr.
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1,Mr.
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0,Mrs.

In [18]:
#Let's see the breakdown of each title
df_titanic.Title.value_counts()

Mr.        240
Miss.       78
Mrs.        72
Master.     21
Rev.         2
Col.         2
Dona.        1
Ms.          1
Dr.          1
Name: Title, dtype: int64

The above example demonstrates how we can use apply on single column or series.  When we use apply on multiple columns we pass the function a row.  Let's create a column called "Old_Man" that is 1 if the  passenger is male and above the age of 60.

In [19]:
def Get_Old_Man(row):
    
    gender  = row["Sex"]
    age  = row["Age"]
    
    if gender == "male" and age>=60:
        return 1
    else:
        return 0

In [20]:
#Make the Old Man column
df_titanic["Old_Man"] = df_titanic.apply(Get_Old_Man, axis=1)
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Binary_Male,Title,Old_Man
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1,Mr.,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0,Mrs.,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1,Mr.,1
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1,Mr.,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0,Mrs.,0

In [25]:
#Lets compute the number of old men.
df_titanic.Old_Man.sum()

13

Note that since we are again applying the function to multiple columns, I have to specify axis=1 because  I want the function applied to each row.

Lastly, let's see how you can use apply with a custom function that take an input that is not just the row.  Considering the problem above, let's allow for an input old_man_age that specifies the lower bound on the age of an old man. Let's recreate the column with this lower bound set to 50.

In [27]:
#Function has new input
def Get_Old_Man(row, old_man_age):
    
    gender  = row["Sex"]
    age  = row["Age"]
    
    if gender == "male" and age>=old_man_age:
        return 1
    else:
        return 0
    
#Make the Old Man column
#need to specify old_man_age explicitly
df_titanic["Old_Man"] = df_titanic.apply(Get_Old_Man, old_man_age=50,  axis=1)
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Binary_Male,Title,Old_Man
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1,Mr.,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0,Mrs.,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1,Mr.,1
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1,Mr.,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0,Mrs.,0

Let's recompute the number of old men, which should go up.

In [28]:
#Lets compute the number of old m
df_titanic.Old_Man.sum()

20

## Iterrows

Iterrows allows us to iterate through the row of a dataframe using a for loop. The iterrows method returns two things when I place it as the object in a for loop and hence I have to define two loop variables. The first item it returns is the index of the given data frame and the second item is the row, which is return as a series.
Let's say I want to create a dictionary where the key is each unique title and the values are lists of ages of each person with that title.

In [63]:
#Initialize dictionary
D= {}

#Use iterrows to iterate over rows of the datafra,e
for index, row in df_titanic.iterrows():
    
    title= row["Title"].strip(" .")
    age = row["Age"]
    
    if title in D.keys():
        D[title].append(age)
    else:
        D[title] = [age]
        
print(D["Master"])

[9.0, 10.0, 13.0, 6.0, 2.0, 13.0, 7.0, 11.5, 8.0, 6.0, 0.33, nan, 0.75, 0.83, nan, nan, 14.5, 5.0, 6.0, 13.0, nan]